dic = {'测试考勤104': {'num': '05217d7561224750892b03d2847e30d4', 'id': '500382199001017104'}, '测试考勤105': {'num': '0e68cc7b55fc4bc586638ab4ca808512', 'id': '500382199001017105'}, '测试考勤108': {'num': '1d11c035592c4d51a88553d0930df85d', 'id': '500382199001017108'}, '测试考勤103': {'num': '207a4ed1195745809fe3d696bb81f1aa', 'id': '500382199001017103'}, '测试考勤106': {'num': '3d96cc7b89cd4111a8ebf6760e0bc5bb', 'id': '500382199001017106'}, '测试考勤109': {'num': '520ff70322fa48eab4dd3c90daf75f20', 'id': '500382199001017109'}, '测试考勤107': {'num': '629f0b0bf6f54d268c6071526e0167bb', 'id': '500382199001017107'}, '测试考勤102': {'num': '7b63d897b4114e92b50cb5668f3df5bd', 'id': '500382199001017102'}, '测试考勤101': {'num': 'e98108d4172946428c512431c4611cea', 'id': '500382199001017101'}, '测试考勤100': {'num': 'f8d3f7b1f368494d92c02b300f6fc845', 'id': '500382199001017100'}}

dic_new = {}
n = 5
m = 0
for key,value in dic.items():
    if m < n:
        dic_new.setdefault(key,value)
    m += 1

# print(len(dic_new))
# print(dic_new)

for i in range(5,7):
    print(i)